<?php

namespace Modules\Job\Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Modules\Job\Database\Models\JobGroup;

class JobGroupSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $groups = [
            'فروش و بازاریابی',
            'وب،‌ برنامه‌نویسی و نرم‌افزار',
            'مالی و حسابداری',
            'مسئول دفتر، اجرائی و اداری',
            'دیجیتال مارکتینگ',
            'پشتیبانی و امور مشتریان',
            'تولید و مدیریت محتوا',
            'طراحی',
            'مهندسی صنایع و مدیریت صنعتی',
            'خرید و بازرگانی',
            'مهندسی برق و الکترونیک',
            'آموزش',
            'منابع انسانی و کارگزینی',
            'مهندسی عمران و معماری',
            'کارگر ساده، نیروی خدماتی',
            'مهندسی مکانیک و هوافضا',
            'انبارداری',
            'تکنسین فنی، تعمیرکار',
            'گردشگری',
            'حوزه‌ سینما و تصویر',
            'مدیر محصول',
            'حمل و نقل',
            'تحقیق بازار و تحلیل اقتصادی',
            'پزشکی،‌ پرستاری و دارویی',
            'کارگر ماهر، کارگر صنعتی',
            'کارشناس حقوقی،‌ وکالت',
            'روابط عمومی',
            'ترجمه',
            'تحقیق و توسعه',
            'راننده، پیک موتوری',
            'صنایع غذایی',
            'مهندسی شیمی و نفت',
            'هتلداری',
            'مدیریت بیمه',
            'نگهبان',
            'مهندسی معدن و متالورژی',
            'مهندسی پزشکی',
            'شیمی، داروسازی',
            'مهندسی نساجی، طراحی پارچه و لباس',
            'علوم زیستی و آزمایشگاهی',
            'مهندسی کشاورزی',
            'خبر‌نگاری',
            'تربیت بدنی',
            'مهندسی پلیمر',
            'حوزه‌ موسیقی و صدا',
        ];
        foreach ($groups as $item)
        {
            JobGroup::create(['title' => $item]);
        }
    }
}
