import React, { useState } from 'react'
import style from './tagsCardSection.module.css'
import cardImage1 from '../../../assets/images/tagsCard-img1.png'
import cardImage2 from '../../../assets/images/tagsCard-img2.png'
import cardImage3 from '../../../assets/images/tagsCard-img3.png'
import cardImage4 from '../../../assets/images/tagsCard-img4.png'
import cardImage5 from '../../../assets/images/tagsCard-img5.png'
import cardImage6 from '../../../assets/images/tagsCard-img6.png'
import cardImage7 from '../../../assets/images/tagsCard-img7.png'
import cardImage8 from '../../../assets/images/tagsCard-img8.png'
import cardImage9 from '../../../assets/images/tagsCard-img9.png'
import cardImage10 from '../../../assets/images/tagsCard-img10.png'
import cardImage11 from '../../../assets/images/tagsCard-img11.png'
import cardImage12 from '../../../assets/images/tagsCard-img12.png'

const TagsCardSection = () => {

    const [cards] = useState([
        {
            image: cardImage1,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage2,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage3,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage4,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage5,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage6,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage7,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage8,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage9,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage10,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage11,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
        {
            image: cardImage12,
            title: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت',
            content: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو.',
            uploadDate: '5 آبان',
            uploadTime: 'ساعت 12:32'
        },
    ])


    return (
        cards.map((item, index) => (
            <div key={index} className={style.card}>
                <div className={style.imageCard}>
                    <img src={item.image} alt="" />
                </div>
                <div className={style.contentCard}>
                    <h4>{item.title}</h4>
                    <p>{item.content}</p>
                    <div>
                        <span>{item.uploadDate}</span>
                        <span>{item.uploadTime}</span>
                    </div>
                </div>
            </div>
        ))
    )
}

export default TagsCardSection